ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map('map', {
            center: [44.601742, 40.10808],
            zoom: 8,
			controls:[]
        }, {
			minZoom:8,
            searchControlProvider: 'yandex#search'
        });
    
	function checkState () {
        var shownObjects,
            terr = new ymaps.GeoQueryResult(),
			track = new ymaps.GeoQueryResult(),
			main = new ymaps.GeoQueryResult();
		main = terr = myObjects.search('geometry.type = "Point"');
		
		 if ($('#track').prop('checked'))
		 {
			track = myObjects.search('geometry.type = "LineString"');
		 }
		 main = main.add(track);
        // Отберем объекты по форме.
        if ($('#ter').prop('checked'))
		{
			terr = myObjects.search('geometry.type = "Polygon"');
		}
		main = main.add(terr);
        
        // Мы отобрали объекты по цвету и по форме. Покажем на карте объекты,
        // которые совмещают нужные признаки.
        shownObjects = main.addToMap(myMap);
        // Объекты, которые не попали в выборку, нужно убрать с карты.
        myObjects.remove(shownObjects).removeFromMap(myMap);
    }
	
	$('#ter').click(checkState);
	$('#track').click(checkState);
	
	 myGeoObject = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.530096,40.176930]
        },
            // Свойства.
        properties: {
		hintContent: 'ЦРБ Майкопского района',
		balloonContentBody: [
            '<strong>ЦРБ Майкопского района</strong>',
            '<br/>',
            'Прикреплено населения: 59643',
            '<br/>',
			'Количество коек: 153',
			'<br/>',
			'Количество врачей: 119',
			'<br/>',
			'Количество мед.персонала: 399',
			'<br/>',
			'График работы:Пн-Пт 8-16 часов',
			'<br/>',
			'Контактные телефоны:',
			'<br/>',
			'Главный врач Хаконов Р.А.',
			'<br/>',
			'2-92-25',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#darkOrangeCircleDotIcon',
    });
	
	 var gran = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
				[
					[44.744595,40.196468],
					[44.742638,40.250027],
					[44.730402,40.250713],
					[44.729424,40.348217],
					[44.725018,40.345470],
					[44.720123,40.347530],
					[44.717185,40.342724],
					[44.714737,40.344784],
					[44.710331,40.339977],
					[44.709351,40.366070],
					[44.703965,40.372250],
					[44.693191,40.368130],
					[44.689272,40.365383],
					[44.686333,40.369503],
					[44.687313,40.373623],
					[44.680945,40.375683],
					[44.679965,40.383236],
					[44.677515,40.389416],
					[44.668696,40.385296],
					[44.658405,40.359890],
					[44.653504,40.359203],
					[44.650563,40.352337],
					[44.645662,40.343410],
					[44.627031,40.338604],
					[44.620166,40.342037],
					[44.618204,40.345470],
					[44.613300,40.350277],
					[44.602018,40.346844],
					[44.596622,40.353023],
					[44.582392,40.342724],
					[44.574049,40.370876],
					[44.532807,40.396282],
					[44.532316,40.412762],
					[44.526913,40.411388],
					[44.514632,40.423061],
					[44.502839,40.408642],
					[44.499891,40.403149],
					[44.487604,40.397655],
					[44.482197,40.383236],
					[44.476297,40.382549],
					[44.476297,40.390789],
					[44.470889,40.389416],
					[44.450736,40.407955],
					[44.443850,40.403149],
					[44.428107,40.415508],
					[44.422202,40.412762],
					[44.421218,40.434734],
					[44.348342,40.463573],
					[44.316799,40.482113],
					[44.308911,40.460827],
					[44.285240,40.442287],
					[44.275867,40.410702],
					[44.246754,40.361263],
					[44.195894,40.393536],
					[44.180083,40.394222],
					[44.147956,40.410702],
					[44.140045,40.404522],
					[44.134111,40.405209],
					[44.113832,40.431988],
					[44.106905,40.423061],
					[44.079676,40.422623],
					[44.064824,40.413010],
					[44.049969,40.430863],
					[44.036101,40.429490],
					[43.987537,40.467942],
					[43.974646,40.469315],
					[43.967703,40.478928],
					[43.957784,40.473435],
					[43.956792,40.454209],
					[43.947863,40.445969],
					[43.942902,40.411637],
					[43.916104,40.407517],
					[43.895253,40.402024],
					[43.884329,40.418503],
					[43.874395,40.414384],
					[43.869431,40.404522],
					[43.830672,40.392162],
					[43.819735,40.379803],
					[43.777958,40.370190],
					[43.772983,40.346844],
					[43.781938,40.320751],
					[43.782933,40.300152],
					[43.770993,40.293285],
					[43.761040,40.275433],
					[43.763031,40.249340],
					[43.775968,40.234234],
					[43.781938,40.215008],
					[43.843594,40.188915],
					[43.862476,40.197155],
					[43.874398,40.188915],
					[43.872411,40.164196],
					[43.858501,40.147716],
					[43.867444,40.105144],
					[43.846576,40.094158],
					[43.866450,40.069439],
					[43.881352,40.041973],
					[43.883338,40.018627],
					[43.910151,39.991161],
					[43.933973,39.951336],
					[43.947866,39.943096],
					[43.957787,39.941036],
					[43.961259,39.927303],
					[43.969194,39.927303],
					[43.973657,39.911510],
					[43.951834,39.903271],
					[43.940920,39.903271],
					[43.937447,39.886791],
					[43.930004,39.886105],
					[43.930996,39.867565],
					[43.925041,39.850399],
					[43.931492,39.814693],
					[43.954314,39.791347],
					[43.962747,39.778988],
					[43.987044,39.815380],
					[43.995967,39.798214],
					[44.020746,39.796154],
					[44.065818,39.829113],
					[44.078689,39.833233],
					[44.122232,39.801647],
					[44.130145,39.776928],
					[44.145969,39.767315],
					[44.185510,39.778301],
					[44.183533,39.863445],
					[44.156845,39.877178],
					[44.146958,39.875805],
					[44.121243,39.899151],
					[44.094526,39.963695],
					[44.077699,39.982922],
					[44.086608,40.013134],
					[44.110360,40.021374],
					[44.134102,40.055706],
					[44.135091,40.063946],
					[44.122232,40.094158],
					[44.131134,40.096905],
					[44.146958,40.070812],
					[44.166731,40.074932],
					[44.180569,40.088665],
					[44.210209,40.073559],
					[44.246745,40.094158],
					[44.272405,40.061199],
					[44.262537,39.988415],
					[44.280298,39.974682],
					[44.316790,39.971935],
					[44.337492,39.973308],
					[44.351289,39.954082],
					[44.338477,39.926617],
					[44.355230,39.908764],
					[44.338477,39.867565],
					[44.359171,39.842846],
					[44.398568,39.879925],
					[44.430066,39.867565],
					[44.435970,39.878551],
					[44.554711,39.885077],
					[44.556184,39.872031],
					[44.586615,39.873404],
					[44.588087,39.929022],
					[44.608692,39.948248],
					[44.589559,39.981207],
					[44.618992,40.002493],
					[44.604768,40.027212],
					[44.603787,40.040259],
					[44.586615,40.052618],
					[44.585143,40.068411],
					[44.579254,40.074591],
					[44.579254,40.095877],
					[44.570911,40.105490],
					[44.574837,40.117163],
					[44.565020,40.123343],
					[44.566002,40.139136],
					[44.560602,40.147375],
					[44.566493,40.167975],
					[44.578763,40.149435],
					[44.604768,40.167975],
					[44.610654,40.156988],
					[44.615559,40.160422],
					[44.614578,40.141196],
					[44.644978,40.130209],
					[44.663113,40.115103],
					[44.674382,40.128836],
					[44.693977,40.134329],
					[44.687120,40.115790],
					[44.675852,40.122656],
					[44.672423,40.119223],
					[44.672913,40.105490],
					[44.656742,40.088324],
					[44.666543,40.077338],
					[44.663603,40.072531],
					[44.678792,40.051245],
					[44.688099,40.060858],
					[44.694957,40.053305],
					[44.701323,40.062918],
					[44.691528,40.076651],
					[44.683691,40.064291],
					[44.677812,40.073218],
					[44.687120,40.091757],
					[44.693487,40.085577],
					[44.703772,40.117163],
					[44.712096,40.113730],
					[44.720419,40.142569],
					[44.711606,40.148062],
					[44.723846,40.198874],
					[44.744402,40.196127]
				]
            ],
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            hintContent: "Майкопский район"
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#0000FF',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 1
    });
	
	//Амбулатория х.Северо-Восточные Сады
	myGeoObject2 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.637778,40.137778]
        },
            // Свойства.
        properties: {
		hintContent: 'Амбулатория х.Северо-Восточные Сады',
		balloonContentBody: [
            '<strong>Амбулатория х.Северо-Восточные Сады</strong>',
            '<br/>',
            'Прикреплено населения: 6800',
            '<br/>',
			'Плановая мощность: 50',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Побединская амбулатория
	myGeoObject3 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.558889,40.145]
        },
            // Свойства.
        properties: {
		hintContent: 'Побединская амбулатория',
		balloonContentBody: [
            '<strong>Побединская амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 5142',
            '<br/>',
			'Плановая мощность: 75',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Районная поликлиника
	myGeoObject4 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.509595,40.179493]
        },
            // Свойства.
        properties: {
		hintContent: 'Районная поликлиника',
		balloonContentBody: [
            '<strong>Районная поликлиника</strong>',
            '<br/>',
            'Прикреплено населения: 10875',
            '<br/>',
			'Плановая мощность: 600',
			'<br/>',
			'График работы:Пн-Пт 8-16 часов',
			'<br/>',
			'Регистратура',
			'<br/>',
			'88772 5-12-74',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#nightCircleDotIcon',
    });
	
	//Стоматологическая поликлиника
	myGeoObject5 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.509783,40.176074]
        },
            // Свойства.
        properties: {
		hintContent: 'Стоматологическая поликлиника',
		balloonContentBody: [
            '<strong>Стоматологическая поликлиника</strong>',
            '<br/>',
            'Прикреплено населения: 10875',
            '<br/>',
			'Плановая мощность: -',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#nightCircleDotIcon',
    });
	
	//Краснооктябрьская амбулатория
	myGeoObject6 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.578611,40.076111]
        },
            // Свойства.
        properties: {
		hintContent: 'Краснооктябрьская амбулатория',
		balloonContentBody: [
            '<strong>Краснооктябрьская амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 8010',
            '<br/>',
			'Плановая мощность: 100',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Отделение скорой медицинской помощи
	myGeoObject7 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.509483,40.179861]
        },
            // Свойства.
        properties: {
		hintContent: 'Отделение скорой медицинской помощи',
		balloonContentBody: [
            '<strong>Отделение скорой медицинской помощи</strong>',
            '<br/>',
            'Прикреплено населения: 60024',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#grayCircleDotIcon',
    });
	
	//Абадзехская амбулатория
	myGeoObject8 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.389444,40.218611]
        },
            // Свойства.
        properties: {
		hintContent: 'Абадзехская амбулатория',
		balloonContentBody: [
            '<strong>Абадзехская амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 6489',
			'<br/>',
			'Плановая мощность: 100',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Каменномостская поликлиника
	myGeoObject9 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.312509,40.194346]
        },
            // Свойства.
        properties: {
		hintContent: 'Каменномостская поликлиника',
		balloonContentBody: [
            '<strong>Каменномостская поликлиника</strong>',
            '<br/>',
            'Прикреплено населения: 7357',
			'<br/>',
			'Плановая мощность: 250',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#nightCircleDotIcon',
    });
	
	//Каменномостская участковая больница
	myGeoObject10 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.311577,40.193316]
        },
            // Свойства.
        properties: {
		hintContent: 'Каменномостская участковая больница',
		balloonContentBody: [
            '<strong>Каменномостская участковая больница</strong>',
            '<br/>',
            'Прикреплено населения: 7357',
			'<br/>',
			'Количество коек: 30',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#darkOrangeCircleDotIcon',
    });
	
	//Кужорская амбулатория
	myGeoObject11 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.681111,40.313889]
        },
            // Свойства.
        properties: {
		hintContent: 'Кужорская амбулатория',
		balloonContentBody: [
            '<strong>Кужорская амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 3825',
			'<br/>',
			'Плановая мощность: 100',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Тимирязева
	myGeoObject12 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.470278, 40.168333]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Тимирязева',
			balloonContent: 'Фельдшерско-акушерский пункт п.Тимирязева<br/>Прикреплено населения: 1152'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт с.Хамышки
	myGeoObject13 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.096944, 40.131111]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт с.Хамышки',
			balloonContent: 'Фельдшерско-акушерский пункт с.Хамышки<br/>Прикреплено населения: 781'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Новосвободная
	myGeoObject14 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.351389, 40.412222]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Новосвободная',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Новосвободная<br/>Прикреплено населения: 618'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Трехречный
	myGeoObject15 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.665, 40.383333]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Трехречный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Трехречный<br/>Прикреплено населения: 653'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Дагестанская
	myGeoObject16 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.368611, 40.015278]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Дагестанская',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Дагестанская<br/>Прикреплено населения: 513'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Безводная
	myGeoObject17 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.375833, 39.913611]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Безводная',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Безводная<br/>Прикреплено населения: 62'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Табачный
	myGeoObject18 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.565278, 40.080278]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Табачный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Табачный<br/>Прикреплено населения: 1926'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Совхозный
	myGeoObject19 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.543333, 40.150833]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Совхозный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Совхозный<br/>Прикреплено населения: 1468'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Цветочный
	myGeoObject20 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.491389, 40.144167]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Цветочный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Цветочный<br/>Прикреплено населения: 1432'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт с.Новопрохладное
	myGeoObject21 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.1375, 40.286667]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт с.Новопрохладное',
			balloonContent: 'Фельдшерско-акушерский пункт с.Новопрохладное<br/>Прикреплено населения: 155'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Победа
	myGeoObject22 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.294722, 40.31]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Победа',
			balloonContent: 'Фельдшерско-акушерский пункт п.Победа<br/>Прикреплено населения: 157'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Севастопольская
	myGeoObject23 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.348889, 40.316944]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Севастопольская',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Севастопольская<br/>Прикреплено населения: 617'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Красная Улька
	myGeoObject24 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.695833, 40.1775]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Красная Улька',
			balloonContent: 'Фельдшерско-акушерский пункт х.Красная Улька<br/>Прикреплено населения: 406'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Пролеарский
	myGeoObject25 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.616389, 40.175833]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Пролеарский',
			balloonContent: 'Фельдшерско-акушерский пункт х.Пролеарский<br/>Прикреплено населения: 1064'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Абадзехская
	myGeoObject26 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.39, 40.199167]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Абадзехская',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Абадзехская<br/>Прикреплено населения: 3643'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Садовый
	myGeoObject27 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.5525, 40.106944]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Садовый',
			balloonContent: 'Фельдшерско-акушерский пункт х.Садовый<br/>Прикреплено населения: 437'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Гражданский
	myGeoObject28 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.689444, 40.146111]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Гражданский',
			balloonContent: 'Фельдшерско-акушерский пункт х.Гражданский<br/>Прикреплено населения: 381'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Советский
	myGeoObject29 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.670556, 40.096667]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Советский',
			balloonContent: 'Фельдшерско-акушерский пункт х.Советский<br/>Прикреплено населения: 490'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Причтовский
	myGeoObject30 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.530278, 40.141944]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Причтовский',
			balloonContent: 'Фельдшерско-акушерский пункт х.Причтовский<br/>Прикреплено населения: 390'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Подгорный
	myGeoObject31 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.460556, 40.180556]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Подгорный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Подгорный<br/>Прикреплено населения: 121'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Даховская
	myGeoObject32 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.232778, 40.204167]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Даховская',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Даховская<br/>Прикреплено населения: 1388'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Усть-Сахрай
	myGeoObject33 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.21, 40.28]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Усть-Сахрай',
			balloonContent: 'Фельдшерско-акушерский пункт п.Усть-Сахрай<br/>Прикреплено населения: 306'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Первомайский
	myGeoObject34 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.412222, 40.177778]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Первомайский',
			balloonContent: 'Фельдшерско-акушерский пункт п.Первомайский<br/>Прикреплено населения: 1277'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт ст.Курджипская
	myGeoObject35 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.462222, 40.051667]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт ст.Курджипская',
			balloonContent: 'Фельдшерско-акушерский пункт ст.Курджипская<br/>Прикреплено населения: 1590'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Калинин
	myGeoObject36 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.699722, 40.132222]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Калинин',
			balloonContent: 'Фельдшерско-акушерский пункт х.Калинин<br/>Прикреплено населения: 276'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Ткачев
	myGeoObject37 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.725833, 40.201389]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Ткачев',
			balloonContent: 'Фельдшерско-акушерский пункт х.Ткачев<br/>Прикреплено населения: 227'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт а.Мафэхабль
	myGeoObject38 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.635833, 40.183056]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт а.Мафэхабль',
			balloonContent: 'Фельдшерско-акушерский пункт а.Мафэхабль<br/>Прикреплено населения: 177'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт п.Удобный
	myGeoObject39 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.551667, 40.156944]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт п.Удобный',
			balloonContent: 'Фельдшерско-акушерский пункт п.Удобный<br/>Прикреплено населения: 1407'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Фельдшерско-акушерский пункт х.Грозный
	myGeoObject40 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.558611, 40.131389]
        },
            // Свойства.
        properties: {
			hintContent: 'Фельдшерско-акушерский пункт х.Грозный',
			balloonContent: 'Фельдшерско-акушерский пункт х.Грозный<br/>Прикреплено населения: 670'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	var route1 = new ymaps.Polyline([
			[44.495843,40.138596],
			[44.494775,40.140125],
			[44.494614,40.140393],
			[44.494438,40.140570],
			[44.493324,40.140929],
			[44.493159,40.141010],
			[44.492986,40.141176],
			[44.492617,40.141664],
			[44.490470,40.143324],
			[44.490121,40.143683],
			[44.490056,40.143801],
			[44.490090,40.144096],
			[44.494009,40.159087],
			[44.494105,40.159634],
			[44.494493,40.163963],
			[44.494538,40.164375],
        ], {
            hintContent: "Маршрут Тульский-Цветочный"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route4 = new ymaps.Polyline([
			[44.311845,40.191862],
			[44.303011,40.189853],
			[44.302903,40.189810],
			[44.302533,40.189531],
			[44.300830,40.187911],
			[44.300260,40.187450],
			[44.298890,40.186174],
			[44.297406,40.184931],
			[44.296489,40.184094],
			[44.295503,40.183128],
			[44.295364,40.183053],
			[44.295257,40.183042],
			[44.294309,40.183375],
			[44.294139,40.183364],
			[44.293986,40.183227],
			[44.293570,40.182417],
			[44.293084,40.181392],
			[44.293084,40.181392],
			[44.292684,40.180437],
			[44.292603,40.180325],
			[44.292503,40.180234],
			[44.292410,40.180164],
			[44.291582,40.179686],
			[44.291312,40.179504],
			[44.290930,40.179150],
			[44.290430,40.178705],
			[44.289647,40.178045],
			[44.288284,40.176600],
			[44.287520,40.175827],
			[44.287523,40.175719],
			[44.287577,40.175333],
			[44.287905,40.173488],
			[44.287947,40.173343],
			[44.288044,40.173177],
			[44.288128,40.173053],
			[44.288733,40.172404],
			[44.289342,40.171744],
			[44.293081,40.167498],
			[44.293386,40.167224],
			[44.293520,40.167143],
			[44.293655,40.166945],
			[44.293886,40.166060],
			[44.294160,40.165550],
			[44.294380,40.165320],
			[44.294491,40.165234],
			[44.294626,40.165196],
			[44.294757,40.165180],
			[44.294819,40.165218],
			[44.294896,40.165314],
			[44.294958,40.165459],
			[44.295027,40.165733],
			[44.295046,40.165856],
			[44.295069,40.166494],
			[44.295124,40.166634],
			[44.295163,40.166726],
			[44.295240,40.166774],
			[44.295394,40.166806],
			[44.295660,40.166876],
			[44.295933,40.167021],
			[44.296407,40.167401],
			[44.297482,40.168399],
			[44.298730,40.169574],
			[44.299636,40.170406],
        ], {
            hintContent: "Маршрут Каменомостский"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route3 = new ymaps.Polyline([
		[44.469903,40.179571],
		[44.468386,40.173381],
		[44.467608,40.173551],
		[44.467001,40.173658],
		[44.466786,40.173717],
		[44.466221,40.173980],
		[44.458142,40.177697],
		[44.457865,40.177794],
		[44.456461,40.172769],
		[44.455900,40.170841],
		[44.455454,40.169071],
		[44.455458,40.169096],
		[44.454334,40.163907],
		[44.454203,40.162464],
		[44.453920,40.156555],
		[44.453805,40.156120],
		[44.452598,40.152102],
		[44.452326,40.151024],
		[44.452034,40.150316],
		[44.451676,40.149635],
		[44.451346,40.149114],
		[44.449175,40.145751],
        ], {
            hintContent: "Маршрут Тульский-Вир"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route5 = new ymaps.Polyline([
		[44.469903,40.179571],
		[44.471532,40.178737],
		[44.473182,40.177908],
		[44.479840,40.174565],
		[44.480366,40.174259],
		[44.481004,40.173819],
		[44.482225,40.172987],
		[44.484078,40.171670],
		[44.485752,40.170483],
		[44.487973,40.168932],
		[44.489383,40.167955],
		[44.491012,40.166811],
		[44.492305,40.165917],
		[44.494528,40.164340],
		[44.494538,40.164375],
        ], {
            hintContent: "Маршрут Тульский-Вир"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2 = new ymaps.Polyline([
			[44.494538,40.164375],
			[44.494980,40.166304],
			[44.495950,40.169718],
			[44.496631,40.171644],
			[44.496953,40.172433],
			[44.497145,40.172787],
			[44.497356,40.172985],
			[44.498642,40.173425],
			[44.498976,40.173377],
			[44.499621,40.173012],
			[44.501219,40.172074],
			[44.502013,40.171365],
			[44.502332,40.171151],
			[44.502516,40.171054],
			[44.502820,40.170974],
			[44.504735,40.170626],
			[44.505146,40.170438],
			[44.505334,40.170395],
			[44.505593,40.170380],
			[44.506530,40.170466],
			[44.506940,40.170597],
			[44.507105,40.170768],
			[44.507182,40.170988],
			[44.507082,40.171879],
			[44.506586,40.174262],
			[44.506578,40.174428],
			[44.506601,40.174546],
			[44.506651,40.174637],
			[44.506816,40.174793],
			[44.507212,40.175067],
			[44.507553,40.175340],
        ], {
            hintContent: "Маршруты: Тульский-Цветочный, Тульский-Вир"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var obj = 
	[	
	myGeoObject40,
	myGeoObject2,
	myGeoObject3,
	myGeoObject4,
	myGeoObject5,
	myGeoObject6,
	myGeoObject7,
	myGeoObject8,
	myGeoObject9,
	myGeoObject10,
	myGeoObject11,
	myGeoObject12,
	myGeoObject13,
	myGeoObject14,
	myGeoObject15,
	myGeoObject16,
	myGeoObject17,
	myGeoObject18,
	myGeoObject19,
	myGeoObject20,
	myGeoObject21,
	myGeoObject22,
	myGeoObject23,
	myGeoObject24,
	myGeoObject25,
	myGeoObject26,
	myGeoObject27,
	myGeoObject28,
	myGeoObject29,
	myGeoObject30,
	myGeoObject31,
	myGeoObject32,
	myGeoObject33,
	myGeoObject34,
	myGeoObject35,
	myGeoObject36,
	myGeoObject37,
	myGeoObject38,
	myGeoObject39,
	myGeoObject,
	route1,
	route2,
	route3,
	route4,
	route5,
	gran
	]
	
	window.myObjects = ymaps.geoQuery(obj).addToMap(myMap);
}
