ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map('map', {
            center: [44.747035,40.589413],
            zoom: 8,
			controls:[]
        }, {
			minZoom:8,
            searchControlProvider: 'yandex#search'
        });
    
	function checkState () {
        var shownObjects,
            terr = new ymaps.GeoQueryResult(),
			track = new ymaps.GeoQueryResult(),
			main = new ymaps.GeoQueryResult();
			
		main = terr = myObjects.search('geometry.type = "Point"');
			
		 if ($('#track').prop('checked'))
		 {
			track = myObjects.search('geometry.type = "LineString"');
		 }
		 main = main.add(track);
        // Отберем объекты по форме.
        if ($('#ter').prop('checked'))
		{
			terr = myObjects.search('geometry.type = "Polygon"');
		}
		main = main.add(terr);
        
        // Мы отобрали объекты по цвету и по форме. Покажем на карте объекты,
        // которые совмещают нужные признаки.
        shownObjects = main.addToMap(myMap);
        // Объекты, которые не попали в выборку, нужно убрать с карты.
        myObjects.remove(shownObjects).removeFromMap(myMap);
    }
	
	$('#ter').click(checkState);
	$('#track').click(checkState);
	
   myGeoObject = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.901389,40.490833]
        },
            // Свойства.
        properties: {
		hintContent: 'Кошехабльская ЦРБ',
		balloonContentBody: [
            '<strong>Кошехабльская ЦРБ</strong>',
            '<br/>',
            'Прикреплено населения: 24646',
            '<br/>',
			'Плановая мощность: 300',
            '<br/>',
			'Количество коек: 87',
			'<br/>',
			'Количество врачей: 61',
			'<br/>',
			'Количество мед.персонала: 188',
			'<br/>',
			'График работы:',
			'<br/>',
			'Контактные телефоны:',
			'<br/>',
			'Главный врач Пшизова З.А.',
			'<br/>',
			'9-14-50',
			'<br/>',
			'Регистратура',
			'<br/>',
			'',
			'<br/>',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#darkOrangeCircleDotIcon',
    });
	
	//Вольненская врачебная амбулатория
	myGeoObject2 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.608611,40.716944]
        },
            // Свойства.
        properties: {
		hintContent: 'Вольненская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Вольненская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 4498',
            '<br/>',
			'Плановая мощность: 30',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП п. Комсомольский
	myGeoObject3 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.9025, 40.422222]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП п. Комсомольский',
			balloonContent: 'ФАП п. Комсомольский<br/>Прикреплено населения: 158'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП х. Политотдел
	myGeoObject4 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.950278, 40.347222]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Политотдел',
			balloonContent: 'ФАП х. Политотдел<br/>Прикреплено населения: 231'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Ходзенская врачебная амбулатория
	myGeoObject5 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.511111,40.711389]
        },
            // Свойства.
        properties: {
		hintContent: 'Ходзенская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Ходзенская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 2872',
            '<br/>',
			'Плановая мощность: 35',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП х.Казенно-Кужорский
	myGeoObject6 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.671111, 40.662222]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х.Казенно-Кужорский',
			balloonContent: 'ФАП х.Казенно-Кужорский<br/>Прикреплено населения: 801'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Врачебная амбулатория п. Дружба
	myGeoObject7 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.933889,40.375833]
        },
            // Свойства.
        properties: {
		hintContent: 'Врачебная амбулатория п. Дружба',
		balloonContentBody: [
            '<strong>Врачебная амбулатория п. Дружба</strong>',
            '<br/>',
            'Прикреплено населения: 5282',
            '<br/>',
			'Плановая мощность: 35',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП х. Красный Фарс
	myGeoObject8 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.914167, 40.353333]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Красный Фарс',
			balloonContent: 'ФАП х. Красный Фарс<br/>Прикреплено населения: 150'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Майская врачебная амбулатория
	myGeoObject9 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.783333,40.546111]
        },
            // Свойства.
        properties: {
		hintContent: 'Майская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Майская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 2626',
            '<br/>',
			'Плановая мощность: 70',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//Врачебная амбулатория а. Блечепсин
	myGeoObject10 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.821389,40.496111]
        },
            // Свойства.
        properties: {
		hintContent: 'Врачебная амбулатория а. Блечепсин',
		balloonContentBody: [
            '<strong>Врачебная амбулатория а. Блечепсин</strong>',
            '<br/>',
            'Прикреплено населения: 3099',
            '<br/>',
			'Плановая мощность: 50',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП х. Кармолино-Гидроицкий
	myGeoObject11 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.573056, 46.683333]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Кармолино-Гидроицкий',
			balloonContent: 'ФАП х. Кармолино-Гидроицкий<br/>Прикреплено населения: 218'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП а. Хачемзий
	myGeoObject12 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.950833, 40.318333]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП а. Хачемзий',
			balloonContent: 'ФАП а. Хачемзий<br/>Прикреплено населения: 685'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	myGeoObject13 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.731944,40.6225]
        },
            // Свойства.
        properties: {
		hintContent: 'Натырбовская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Натырбовская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 3914',
            '<br/>',
			'Плановая мощность: 70',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП а. Егерухай
	myGeoObject14 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.000278, 40.393611]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП а. Егерухай',
			balloonContent: 'ФАП а. Егерухай<br/>Прикреплено населения: 1620'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП х. Шелковников
	myGeoObject15 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.574722, 40.717778]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Шелковников',
			balloonContent: 'ФАП х. Шелковников<br/>Прикреплено населения: 213'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП х. Игнатьевский
	myGeoObject16 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.841111, 40.461111]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Игнатьевский',
			balloonContent: 'ФАП х. Игнатьевский<br/>Прикреплено населения: 958'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП х. Красный
	myGeoObject17 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.773611, 40.519167]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП х. Красный',
			balloonContent: 'ФАП х. Красный<br/>Прикреплено населения: 220'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	var route1 = new ymaps.Polyline([
		[44.908887,40.552909],
		[44.908814,40.551531],
		[44.908807,40.551064],
		[44.908807,40.550731],
		[44.908841,40.549873],
		[44.908910,40.549052],
		[44.908936,40.548232],
		[44.908967,40.547465],
		[44.908952,40.546772],
		[44.907532,40.536631],
		[44.907269,40.535596],
		[44.906945,40.534706],
		[44.906514,40.533810],
		[44.906158,40.533298],
		[44.902009,40.528304],
		[44.901959,40.528202],
		[44.901781,40.527908],
		[44.901778,40.527816],
		[44.901713,40.527677],
		[44.901648,40.527634],
		[44.901522,40.527612],
		[44.901236,40.527720],
		[44.901126,40.527763],
		[44.900846,40.527851],
		[44.900747,40.527834],
		[44.900644,40.527818],
        ], {
            hintContent: "Маршрут г.Курганинск - а.Кошехабль - п.Дружба - п.Майский"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route1_1 = new ymaps.Polyline([
		[44.901967,40.528290],
		[44.901841,40.528231],
		[44.901681,40.528231],
		[44.901597,40.528242],
		[44.901372,40.528339],
		[44.901170,40.528333],
		[44.901063,40.528312],
		[44.900979,40.528242],
		[44.900690,40.527931],
		[44.900587,40.527775],
		[44.900480,40.527615],
		[44.900334,40.527355],
		[44.899888,40.526239],
		[44.899610,40.525450],
		[44.896879,40.515008],
		[44.896589,40.514048],
		[44.896162,40.512927],
		[44.895914,40.512385],
		[44.895834,40.512240],
		[44.895640,40.512020],
		[44.895510,40.511913],
		[44.895388,40.511864],
		[44.895231,40.511850],
		[44.895025,40.511856],
		[44.894663,40.511872],
		[44.894499,40.511840],
		[44.894415,40.511813],
		[44.894312,40.511716],
		[44.894262,40.511614],
		[44.894167,40.511528],
		[44.894098,40.511475],
		[44.894018,40.511346],
		[44.893969,40.511201],
		[44.893927,40.511046],
		[44.893877,40.509741],
		[44.893923,40.508689],
		[44.894247,40.505203],
		[44.894700,40.500578],
		[44.894762,40.499910],
		[44.894842,40.499476],
		[44.895078,40.498811],
		[44.895566,40.497706],
		[44.895673,40.497314],
		[44.895719,40.496987],
		[44.895730,40.496708],
		[44.895688,40.496026],
		[44.895528,40.494101],
		[44.895501,40.493854],
		[44.895505,40.493457],
		[44.895547,40.492850],
		[44.895715,40.490924],
		[44.895867,40.489562],
		[44.895989,40.488682],
		[44.896066,40.488462],
		[44.896664,40.487159],
		[44.897000,40.486445],
		[44.898162,40.483815],
		[44.901150,40.477308],
		[44.902107,40.475162],
		[44.902363,40.474454],
		[44.902489,40.474046],
		[44.902717,40.473419],
		[44.904900,40.466844],
		[44.914201,40.438889],
		[44.931724,40.386121],
		[44.932086,40.385177],
		[44.932368,40.384619],
		[44.932589,40.384276],
		[44.933386,40.383109],
		[44.935466,40.379969],
        ], {
            hintContent: "Маршрут г.Курганинск - а.Кошехабль - п.Дружба - п.Майский"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route1_2 = new ymaps.Polyline([
		[44.784537,40.546662],
		[44.785492,40.547654],
		[44.785717,40.547965],
        ], {
            hintContent: "Маршрут г.Курганинск - а.Кошехабль - п.Дружба - п.Майский"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2 = new ymaps.Polyline([
		[44.525794,40.708533],
		[44.541937,40.711441],
		[44.542102,40.711409],
		[44.542209,40.711350],
		[44.542635,40.710910],
		[44.542857,40.711382],
		[44.542915,40.712122],
		[44.543195,40.712042],
		[44.543678,40.711940],
		[44.544183,40.711914],
		[44.544717,40.711968],
		[44.562471,40.715091],
		[44.562838,40.715158],
		[44.563321,40.715158],
		[44.563981,40.715083],
		[44.575498,40.713466],
		[44.577607,40.713198],
		[44.579608,40.712988],
		[44.580222,40.713010],
		[44.581543,40.713120],
		[44.584234,40.713371],
		[44.585920,40.713564],
		[44.593478,40.714290],
		[44.594022,40.714338],
		[44.594543,40.714338],
		[44.595111,40.714210],
		[44.602911,40.712194],
		[44.603494,40.711915],
		[44.604268,40.711400],
		[44.610622,40.706726],
		[44.616764,40.702193],
		[44.618227,40.701120],
		[44.618986,40.700326],
		[44.620097,40.698663],
		[44.623141,40.693768],
		[44.623417,40.693414],
		[44.623784,40.693039],
		[44.624178,40.692695],
		[44.635803,40.684364],
		[44.636668,40.683849],
		[44.637174,40.683613],
		[44.637634,40.683473],
		[44.638484,40.683312],
		[44.642077,40.682972],
		[44.643318,40.682522],
		[44.644191,40.681878],
		[44.653299,40.674030],
		[44.654371,40.673322],
		[44.655336,40.672807],
		[44.656730,40.672314],
		[44.664261,40.670293],
		[44.664782,40.670057],
		[44.666543,40.668104],
		[44.666987,40.667589],
		[44.667599,40.667074],
		[44.673271,40.663822],
		[44.674005,40.663265],
		[44.675906,40.661298],
		[44.679305,40.657586],
		[44.693304,40.645214],
		[44.695830,40.642274],
		[44.696518,40.641738],
		[44.701763,40.638161],
		[44.702498,40.637753],
		[44.717608,40.629886],
		[44.718435,40.629306],
		[44.719016,40.628555],
		[44.720684,40.625894],
		[44.721020,40.625551],
		[44.740912,40.617226],
		[44.741187,40.617054],
		[44.741691,40.616346],
		[44.748711,40.602735],
		[44.780143,40.556051],
		[44.785751,40.547940],
        ], {
            hintContent: "Маршрут а.Ходзь - г.Лабинск - а.Кошехабль"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route1_2_1 = new ymaps.Polyline([
		[44.784537,40.546662],
		[44.785492,40.547654],
		[44.785717,40.547965],
		[44.790401,40.541310],
		[44.793923,40.536395],
		[44.795970,40.533788],
		[44.798805,40.530249],
		[44.802937,40.525052],
		[44.803284,40.524653],
		[44.803841,40.524101],
		[44.804810,40.523221],
		[44.816613,40.512353],
		[44.818458,40.510637],
		[44.822046,40.507284],
		[44.825626,40.504019],
		[44.830375,40.499599],
		[44.832730,40.497485],
		[44.833245,40.497040],
		[44.833432,40.496911],
		[44.833626,40.496843],
		[44.833828,40.496800],
		[44.834030,40.496795],
		[44.834290,40.496805],
		[44.834881,40.496832],
		[44.835324,40.496886],
		[44.837530,40.497149],
		[44.837813,40.497191],
		[44.841026,40.497970],
		[44.842232,40.498261],
		[44.842869,40.498428],
		[44.843878,40.498769],
		[44.867991,40.508089],
		[44.868968,40.508433],
		[44.869670,40.508518],
		[44.874064,40.508840],
		[44.874751,40.508926],
		[44.877299,40.509656],
		[44.879359,40.510360],
		[44.885835,40.512742],
		[44.887177,40.513106],
		[44.887957,40.513228],
		[44.888613,40.513185],
		[44.889909,40.512884],
		[44.892197,40.512316],
		[44.892563,40.512241],
		[44.892925,40.512176],
		[44.893120,40.512171],
		[44.893438,40.512183],
		[44.893918,40.512301],
		[44.894075,40.512328],
		[44.894277,40.512183],
		[44.894342,40.512075],
		[44.894517,40.511931],
		[44.894685,40.511888],
        ], {
            hintContent: "Маршруты: г.Курганинск - а.Кошехабль - п.Дружба - п.Майский;<br/>а.Ходзь - г.Лабинск - а.Кошехабль"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var gran = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
				[
										//
					[45.044061,40.352096],
					[45.040654,40.360336],
					[45.032864,40.358276],
					[45.029456,40.364456],
					[45.032377,40.379562],
					[45.028969,40.387802],
					[45.024587,40.385742],
					[45.000233,40.423508],
					[45.001208,40.431061],
					[44.986591,40.437927],
					[44.987566,40.443420],
					[44.981718,40.447540],
					[44.935891,40.518951],
					[44.931014,40.531998],
					[44.897837,40.538864],
					[44.889539,40.559463],
					[44.889539,40.558777],
					[44.869035,40.569076],
					[44.863175,40.588989],
					[44.858780,40.586243],
					[44.852919,40.592422],
					[44.843150,40.594482],
					[44.830447,40.586243],
					[44.803567,40.613708],
					[44.792811,40.624695],
					[44.757597,40.629501],
					[44.743218,40.639400],
					[44.709932,40.649013],
					[44.704056,40.654506],
					[44.685934,40.656566],
					[44.673197,40.675792],
					[44.661437,40.685405],
					[44.645753,40.688838],
					[44.607996,40.735530],
					[44.597203,40.738963],
					[44.561869,40.725231],
					[44.531916,40.732784],
					[44.531425,40.738963],
					[44.507844,40.747890],
					[44.493593,40.756130],
					[44.490644,40.766429],
					[44.479830,40.775356],
					[44.469505,40.773982],
					[44.464401,40.765905],
					[44.464155,40.762129],
					[44.464647,40.618277],
					[44.468334,40.621710],
					[44.473989,40.617247],
					[44.482100,40.618277],
					[44.482838,40.661535],
					[44.520185,40.662222],
					[44.530992,40.657759],
					[44.536886,40.669088],
					[44.541571,40.667397],
					[44.545500,40.672203],
					[44.572010,40.648857],
					[44.584279,40.643364],
					[44.634801,40.644051],
					[44.636271,40.618645],
					[44.653428,40.618645],
					[44.654409,40.567833],
					[44.740115,40.568520],
					[44.744030,40.563026],
					[44.742073,40.519768],
					[44.764090,40.529381],
					[44.763112,40.465523],
					//end
					[44.804189,40.440804],
					[44.828137,40.415398],
					[44.827160,40.392738],
					[44.836444,40.391365],
					[44.837421,40.403725],
					[44.844749,40.389305],
					[44.849145,40.398918],
					[44.847191,40.405098],
					[44.861355,40.432564],
					[44.852076,40.438057],
					[44.856960,40.445610],
					[44.882839,40.414711],
					[44.884791,40.420204],
					[44.901386,40.415398],
					[44.902850,40.378319],
					[44.913097,40.352913],
					[44.917488,40.296608],
					[44.939438,40.267769],
					[44.971616,40.317207],
					[44.970154,40.321327],
					[44.960405,40.317894],
					[44.955042,40.335060],
					[44.973566,40.361839],
					[44.980389,40.355659],
					[44.989648,40.367332],
					[44.997443,40.362526],
					[45.012544,40.331627],
					[45.026180,40.322700],
					[45.044194,40.350853],
				]
            ],
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            hintContent: "Кошехабльский район"
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#0000FF',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 1
    });
	
	var obj = 
	[	
	myGeoObject2,
	myGeoObject3,
	myGeoObject4,
	myGeoObject5,
	myGeoObject6,
	myGeoObject7,
	myGeoObject8,
	myGeoObject9,
	myGeoObject10,
	myGeoObject11,
	myGeoObject12,
	myGeoObject13,
	myGeoObject14,
	myGeoObject15,
	myGeoObject16,
	myGeoObject17,
	myGeoObject,
	route1,
	route1_1,
	route1_2,
	route1_2_1,
	route2,
	gran
	]
	
	window.myObjects = ymaps.geoQuery(obj).addToMap(myMap);
}
