ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map('map', {
            center: [45.098271,39.652142],
            zoom: 10,
			controls:[]
        }, {
			minZoom:8,
            searchControlProvider: 'yandex#search'
        });
		
	function checkState () {
        var shownObjects,
            terr = new ymaps.GeoQueryResult(),
			track = new ymaps.GeoQueryResult(),
			main = new ymaps.GeoQueryResult();
			
		main = terr = myObjects.search('geometry.type = "Point"');
			
		 if ($('#track').prop('checked'))
		 {
			track = myObjects.search('geometry.type = "LineString"');
		 }
		 main = main.add(track);
        // Отберем объекты по форме.
        if ($('#ter').prop('checked'))
		{
			terr = myObjects.search('geometry.type = "Polygon"');
		}
		main = main.add(terr);
        
        // Мы отобрали объекты по цвету и по форме. Покажем на карте объекты,
        // которые совмещают нужные признаки.
        shownObjects = main.addToMap(myMap);
        // Объекты, которые не попали в выборку, нужно убрать с карты.
        myObjects.remove(shownObjects).removeFromMap(myMap);
    }
	
	$('#ter').click(checkState);
	$('#track').click(checkState);
    
	myGeoObject = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.1425,39.577778]
        },
            // Свойства.
        properties: {
		hintContent: 'Красногвардейская центральна районная больница',
		balloonContentBody: [
            '<strong>Красногвардейская центральна районная больница</strong>',
            '<br/>',
            'Прикреплено населения: 31157',
            '<br/>',
			'Количество коек: 115',
			'<br/>',
			'Количество врачей: 61',
			'<br/>',
			'Количество мед.персонала: 193',
			'<br/>',
			'График работы:Пн-Пт 8-17 часов',
			'<br/>',
			'Контактные телефоны:',
			'<br/>',
			'Главный врач Тхитлянов Э.А.',
			'<br/>',
			'',
			'<br/>',
			'Регистратура',
			'<br/>',
			'887778 5-20-75',
			'<br/>',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#darkOrangeCircleDotIcon',
    });
	
	//Врачебная амбулатория с.Садовое
	myGeoObject2 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.001667, 39.697778]
        },
            // Свойства.
        properties: {
			hintContent: 'Врачебная амбулатория с.Садовое',
			balloonContent: 'Врачебная амбулатория с.Садовое <br/>Прикреплено населения: 2951<br/> Плановая мощность: 10'
		}
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП Бжедугхабль
	myGeoObject3 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [44.977222, 39.706667]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Бжедугхабль',
			balloonContent: 'ФАП Бжедугхабль <br/>Прикреплено населения: 1013'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Хатукайская врачебная амбулатория
	myGeoObject4 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.189722,39.665833]
        },
            // Свойства.
        properties: {
		hintContent: 'Хатукайская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Хатукайская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 5032',
            '<br/>',
			'Плановая мощность: 25',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ДХ х. Папенков
	myGeoObject5 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.074167, 39.587222]
        },
            // Свойства.
        properties: {
			hintContent: 'ДХ х. Папенков',
			balloonContent: 'ДХ х. Папенков'
		}
    }, {
            // Опции.
        preset: 'islands#yellowCircleDotIcon',
    });
	
	//ДХ п. Свободный
	myGeoObject6 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.188611, 39.591667]
        },
            // Свойства.
        properties: {
			hintContent: 'ДХ п. Свободный',
			balloonContent: 'ДХ п. Свободный'
		}
    }, {
            // Опции.
        preset: 'islands#yellowCircleDotIcon',
    });
	
	//Врачебная амбулатория с.Белое
	myGeoObject7 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.049978,39.648537]
        },
            // Свойства.
        properties: {
		hintContent: 'Врачебная амбулатория с.Белое',
		balloonContentBody: [
            '<strong>Врачебная амбулатория с.Белое</strong>',
            '<br/>',
            'Прикреплено населения: 5483',
            '<br/>',
			'Плановая мощность: 15',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП Преображенское
	myGeoObject8 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.083611, 39.628611]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Преображенское',
			balloonContent: 'ФАП Преображенское<br/>Прикреплено населения: 1444'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Еленовская врачебная амбулатория
	myGeoObject9 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.109444,39.688056]
        },
            // Свойства.
        properties: {
		hintContent: 'Еленовская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Еленовская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 3138',
            '<br/>',
			'Плановая мощность: 15',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ФАП №1
	myGeoObject10 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.125, 39.654167]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП №1',
			balloonContent: 'ФАП №1<br/>Прикреплено населения: 476'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП №3
	myGeoObject11 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.086111, 39.7475]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП №3',
			balloonContent: 'ФАП №3<br/>Прикреплено населения: 883'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП Саратовский
	myGeoObject12 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.100833, 39.758333]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Саратовский',
			balloonContent: 'ФАП Саратовский<br/>Прикреплено населения: 478'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП Джамбичий
	myGeoObject13 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.088611, 39.858889]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Джамбичий',
			balloonContent: 'ФАП Джамбичий<br/>Прикреплено населения: 552'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП В-Назаровское
	myGeoObject14 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.003333, 39.753333]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП В-Назаровское',
			balloonContent: 'ФАП В-Назаровское<br/>Прикреплено населения: 564'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ФАП Штурбино
	myGeoObject15 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.061389, 39.908056]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Штурбино',
			balloonContent: 'ФАП Штурбино<br/>Прикреплено населения: 510'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//ДХ п. Набережный
	myGeoObject16 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.211389, 39.632222]
        },
            // Свойства.
        properties: {
			hintContent: 'ДХ п. Набережный',
			balloonContent: 'ДХ п. Набережный'
		}
    }, {
            // Опции.
        preset: 'islands#yellowCircleDotIcon',
    });
	
	//ФАП Н-Севастопольское
	myGeoObject17 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.063889, 39.709722]
        },
            // Свойства.
        properties: {
			hintContent: 'ФАП Н-Севастопольское',
			balloonContent: 'ФАП Н-Севастопольское<br/>Прикреплено населения: 822'
		}
    }, {
            // Опции.
        preset: 'islands#darkGreenCircleDotIcon',
    });
	
	//Адамиевская врачебная амбулатория
	myGeoObject18 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.073333,39.500833]
        },
            // Свойства.
        properties: {
		hintContent: 'Адамиевская врачебная амбулатория',
		balloonContentBody: [
            '<strong>Адамиевская врачебная амбулатория</strong>',
            '<br/>',
            'Прикреплено населения: 1316',
            '<br/>',
			'Плановая мощность: 10',
        ].join('')
        }
    }, {
            // Опции.
        preset: 'islands#blueCircleDotIcon',
    });
	
	//ДХ п. Мирный
	myGeoObject19 = new ymaps.GeoObject({
            // Описание геометрии.
        geometry: {
            type: "Point",
            coordinates: [45.059167, 39.5775]
        },
            // Свойства.
        properties: {
			hintContent: 'ДХ п. Мирный',
			balloonContent: 'ДХ п. Мирный'
		}
    }, {
            // Опции.
        preset: 'islands#yellowCircleDotIcon',
    });
	
	var route1 = new ymaps.Polyline([
		[45.136925,39.583913],
		[45.136617,39.584171],
		[45.136234,39.584573],
		[45.127942,39.593571],
		[45.106563,39.616144],
		[45.101087,39.621909],
		[45.097685,39.625515],
		[45.096392,39.626880],
		[45.095963,39.627304],
		[45.095876,39.627395],
		[45.095062,39.628350],
		[45.095032,39.628426],
		[45.094292,39.628954],
		[45.093358,39.629694],
		[45.091404,39.631282],
		[45.089360,39.632937],
		[45.083380,39.637817],
		[45.076356,39.643525],
		[45.073797,39.645616],
		[45.071222,39.647716],
		[45.068796,39.649696],
		[45.066509,39.651603],
		[45.064370,39.653394],
		[45.062203,39.655214],
		[45.061832,39.655518],
		[45.060155,39.656924],
		[45.058564,39.658258],
		[45.056726,39.659783],
		[45.054847,39.661364],
		[45.053230,39.662723],
		[45.049739,39.665641],
		[45.049891,39.666692],
		[45.050112,39.668114],
		[45.050487,39.670796],
		[45.050859,39.673280],
		[45.051449,39.677426],
		[45.051605,39.678626],
		[45.051651,39.678926],
		[45.051692,39.679146],
		[45.051757,39.679345],
		[45.051829,39.679538],
		[45.052251,39.680460],
		[45.053253,39.682723],
		[45.053454,39.683222],
		[45.053564,39.683624],
		[45.053660,39.684021],
		[45.053785,39.685040],
		[45.053880,39.685502],
		[45.054055,39.685968],
		[45.054222,39.686274],
		[45.059849,39.696707],
		[45.060031,39.697029],
		[45.061372,39.699158],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Преображенское - с.Белое - с.Новосевостопольское"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route1_1 = new ymaps.Polyline([
		[45.048361,39.648923],
		[45.050703,39.657828],
		[45.051068,39.659223],
		[45.051103,39.659647],
		[45.051087,39.659904],
		[45.051011,39.660194],
		[45.050522,39.661515],
		[45.049683,39.663617],
		[45.049630,39.663778],
		[45.049580,39.664008],
		[45.049542,39.664293],
		[45.049561,39.664529],
		[45.049660,39.665103],
		[45.049744,39.665645],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Преображенское - с.Белое - с.Новосевостопольское"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2 = new ymaps.Polyline([
		[45.145028,39.599055],
		[45.140975,39.608222],
		[45.129362,39.635096],
		[45.125124,39.644817],
		[45.124790,39.645546],
		[45.121583,39.651804],
		[45.120627,39.653666],
		[45.120338,39.654245],
		[45.120152,39.654701],
		[45.119909,39.655393],
		[45.119653,39.656188],
		[45.119395,39.656955],
		[45.119212,39.657475],
		[45.119045,39.657910],
		[45.118609,39.659023],
		[45.117481,39.661920],
		[45.117326,39.662397],
		[45.117246,39.662864],
		[45.117200,39.663760],
		[45.117113,39.667252],
		[45.117029,39.667740],
		[45.116999,39.667901],
		[45.116801,39.668352],
		[45.115149,39.671497],
		[45.114572,39.672586],
		[45.112633,39.676225],
		[45.109632,39.681938],
		[45.108327,39.684448],
		[45.107901,39.685285],
		[45.106714,39.687832],
		[45.104284,39.693170],
		[45.102892,39.696202],
		[45.101950,39.698426],
		[45.101893,39.698609],
		[45.101407,39.700218],
		[45.097634,39.712465],
		[45.095427,39.719763],
		[45.095381,39.719983],
		[45.093925,39.725666],
		[45.092776,39.730149],
		[45.092624,39.730776],
		[45.092548,39.731039],
		[45.092373,39.731549],
		[45.092198,39.732021],
		[45.091663,39.733154],
		[45.088960,39.738507],
		[45.085024,39.746423],
		[45.083092,39.749546],
		[45.075903,39.760882],
		[45.072352,39.766555],
		[45.069525,39.771023],
		[45.068517,39.772638],
		[45.067845,39.773744],
		[45.067583,39.774275],
		[45.067488,39.774495],
		[45.067381,39.774823],
		[45.067159,39.775656],
		[45.064723,39.785264],
		[45.064069,39.788021],
		[45.062987,39.793717],
		[45.062500,39.799216],
		[45.060892,39.817484],
		[45.060751,39.818235],
		[45.060622,39.818654],
		[45.060542,39.818868],
		[45.058482,39.823729],
		[45.056463,39.828580],
		[45.056246,39.829245],
		[45.056136,39.829824],
		[45.056056,39.830656],
		[45.054877,39.849705],
		[45.053809,39.866835],
		[45.053021,39.879226],
		[45.053022,39.879972],
		[45.053048,39.885033],
		[45.053044,39.889812],
		[45.052991,39.890579],
		[45.052934,39.891013],
		[45.052375,39.895155],
		[45.052143,39.897109],
		[45.052082,39.897854],
		[45.052071,39.899088],
		[45.052053,39.902284],
		[45.052026,39.902573],
		[45.051996,39.902906],
		[45.051821,39.904129],
		[45.051623,39.905867],
		[45.051501,39.907184],
		[45.051398,39.908766],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Еленовское - с.Большесидоровское - а.Джамбичи - с.Штурбино"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2_1 = new ymaps.Polyline([
		[45.039713,39.830119],
		[45.042061,39.829244],
		[45.043074,39.828881],
		[45.044313,39.828452],
		[45.046087,39.827834],
		[45.048273,39.827091],
		[45.050277,39.826415],
		[45.053980,39.825187],
		[45.055398,39.824719],
		[45.057405,39.824054],
		[45.058481,39.823716],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Еленовское - с.Большесидоровское - а.Джамбичи - с.Штурбино"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2_2 = new ymaps.Polyline([
		[45.082282,39.856170],
		[45.081036,39.855910],
		[45.080144,39.855755],
		[45.079169,39.855600],
		[45.078724,39.855519],
		[45.078485,39.855439],
		[45.077087,39.854747],
		[45.075770,39.854018],
		[45.073588,39.852846],
		[45.068416,39.850157],
		[45.068006,39.849965],
		[45.067652,39.849879],
		[45.067120,39.849838],
		[45.066482,39.849827],
		[45.062715,39.849821],
		[45.054878,39.849704],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Еленовское - с.Большесидоровское - а.Джамбичи - с.Штурбино"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route2_3 = new ymaps.Polyline([
		[45.058079,39.908300],
		[45.057687,39.908198],
		[45.056989,39.908220],
		[45.055620,39.908343],
		[45.053818,39.908516],
		[45.051794,39.908717],
		[45.051399,39.908755],
        ], {
            hintContent: "Маршрут c.Красногвардейское - с.Еленовское - с.Большесидоровское - а.Джамбичи - с.Штурбино"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	var route3 = new ymaps.Polyline([
		[45.091297,39.541380],
		[45.090712,39.540511],
		[45.088085,39.534026],
		[45.075822,39.510325],
		[45.074188,39.504936],
		[45.072990,39.501396],
		[45.069025,39.497363],
		[45.066539,39.494814],
		[45.065684,39.495658],
		[45.065246,39.497622],
		[45.065106,39.497573],
		[45.063221,39.499648],
		[45.062056,39.500342],
		[45.061554,39.500755],
		[45.060999,39.501313],
		[45.060509,39.502209],
		[45.060010,39.503496],
		[45.059649,39.504615],
		[45.059452,39.504629],
		[45.059201,39.504505],
		[45.058608,39.503765],
        ], {
            hintContent: "Маршрут c.Красногвардейское - а.Адамий - х.Чумаков"
        }, {
            strokeColor: "#4979C1",
            strokeWidth: 6,		
			strokeOpacity: 0.4
	});
	
	 var gran = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
				[
										//
					[45.022920,39.884548],
					[45.018537,39.855709],
					[45.016345,39.857082],
					[45.012936,39.854336],
					[45.012449,39.849529],
					[45.014397,39.847469],
					[44.990040,39.765072],
					[44.973958,39.771938],
					[44.951534,39.697094],
					[44.954459,39.688167],
					[44.956897,39.692287],
					[44.957384,39.686107],
					[44.963722,39.690227],
					[44.980781,39.684734],
					[44.983705,39.677868],
					[44.996373,39.678554],
					[44.996373,39.675121],
					[44.990040,39.671001],
					[44.992476,39.664821],
					[44.982730,39.644222],
					[44.975907,39.651088],
					[44.960309,39.620189],
					[44.983218,39.600277],
					[45.000758,39.640789],
					[45.006117,39.639415],
					[45.016345,39.645595],
					[45.016832,39.637356],
					[45.023650,39.642162],
					[45.022189,39.651775],
					[45.034849,39.651775],
					[45.049940,39.621563],
					[45.042639,39.612636],
					[45.048480,39.580364],
					[45.047506,39.565258],
					[45.032902,39.569378],
					[45.035823,39.543285],
					[45.043612,39.550152],
					[45.044586,39.530925],
					[45.053347,39.544658],
					[45.055294,39.524059],
					[45.048480,39.524059],
					[45.049453,39.514446],
					[45.043612,39.518566],
					[45.044586,39.504833],
					[45.039718,39.510326],
					[45.036797,39.493847],
					[45.047506,39.492473],
					[45.033875,39.488353],
					[45.036797,39.471874],
					[44.992963,39.473247],
					//end
					[45.007578,39.416942],
					[45.014397,39.415569],
					[44.992963,39.396343],
					[45.014397,39.372997],
					[45.003681,39.353771],
					[45.005629,39.337291],
					[45.029980,39.311199],
					[45.030954,39.320812],
					//
					[45.043612,39.320812],
					[45.054321,39.375744],
					[45.075731,39.388103],
					[45.083515,39.404583],
					[45.097134,39.403209],
					[45.094216,39.423809],
					[45.109778,39.440288],
					[45.106860,39.466381],
					[45.122418,39.456768],
					[45.123633,39.473934],
					[45.142831,39.489727],
					[45.166452,39.520626],
					[45.162566,39.538479],
					[45.185878,39.546032],
					[45.200686,39.574871],
					[45.201414,39.584484],
					[45.210637,39.594784],
					[45.217674,39.622936],
					[45.194132,39.686465],
					[45.186606,39.690585],
					[45.186606,39.676166],
					[45.179322,39.685779],
					[45.168638,39.685092],
					[45.166209,39.672046],
					[45.165723,39.679599],
					[45.159894,39.687838],
					[45.156979,39.700198],
					[45.147262,39.715991],
					[45.149691,39.729724],
					[45.128308,39.734530],
					[45.137543,39.761996],
					[45.132683,39.780536],
					[45.125878,39.782596],
					[45.129766,39.802508],
					[45.114211,39.812808],
					[45.121503,39.816928],
					[45.115183,39.831347],
					[45.117614,39.841647],
					[45.107403,39.845080],
					[45.118100,39.851260],
					[45.110321,39.872546],
					[45.102054,39.855380],
					[45.104972,39.869113],
					[45.098164,39.899325],
					[45.091355,39.898639],
					[45.096219,39.921298],
					[45.094273,39.949450],
					[45.082113,39.956317],
					[45.097678,39.972796],
					[45.089896,40.008502],
					//end
					[45.057785,40.016055],
					[45.055351,40.005755],
					[45.020298,40.014682],
					[45.013967,39.964557],
					[45.016402,39.963870],
					[45.012506,39.941211],
					[45.018837,39.937091],
					[45.016402,39.908938],
					[45.027116,39.907565],
					[45.027116,39.885592],
					[45.022733,39.883532],
					[45.019811,39.856067],
					[45.012506,39.851947],
					[45.013967,39.847140],
					[44.990097,39.765429],
				]
            ],
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            hintContent: "Красногвардейский район"
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#0000FF',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.2,
        // Ширина обводки.
        strokeWidth: 1
    });
	
	var obj = 
	[	
	myGeoObject19,
	myGeoObject2,
	myGeoObject3,
	myGeoObject4,
	myGeoObject5,
	myGeoObject6,
	myGeoObject7,
	myGeoObject8,
	myGeoObject9,
	myGeoObject10,
	myGeoObject11,
	myGeoObject12,
	myGeoObject13,
	myGeoObject14,
	myGeoObject15,
	myGeoObject16,
	myGeoObject17,
	myGeoObject18,
	myGeoObject,
	route1,
	route1_1,
	route2,
	route2_1,
	route2_2,
	route2_3,
	route3,
	gran
	]
	
	window.myObjects = ymaps.geoQuery(obj).addToMap(myMap);
}
